{
	"users": [
		{
			"id": "001",
			"login": "admin_root",
			"password": "root",
			"registed_at": "2020-05-12",
			"role_id": 0
		},
		{
			"id": "002",
			"login": "user_ivan",
			"password": "pass123",
			"registed_at": "2022-07-18",
			"role_id": 1
		},
		{
			"id": "003",
			"login": "guest_alex",
			"password": "guest",
			"registed_at": "2023-03-05",
			"role_id": 2
		},
		{
			"id": "004",
			"login": "moderator_kate",
			"password": "modpass",
			"registed_at": "2021-11-29",
			"role_id": 3
		}
	],
	"roles": [
		{
			"id": 0,
			"name": "Администратор"
		},
		{
			"id": 1,
			"name": "Читатель"
		},
		{
			"id": 2,
			"name": "Гость"
		},
		{
			"id": 3,
			"name": "Модератор"
		}
	],
	"posts": [
		{
			"id": 1,
			"title": "Плановых заданий",
			"image_url": "https://fastly.picsum.photos/id/767/280/150.jpg?hmac=f6ArmTIDt5p9Pfn7TStRDgHHsDy577ehwcMPNlvhUmI",
			"content": "Таким образом реализация намеченных плановых заданий играет важную роль в формировании новых предложений. Значимость этих проблем настолько очевидна, что постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять важные задания по разработке дальнейших направлений развития. Равным образом рамки и место обучения кадров в значительной степени обуславливает создание новых предложений. Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Задача организации, в особенности же укрепление и развитие структуры требуют определения и уточнения систем массового участия. Товарищи! дальнейшее развитие различных форм деятельности играет важную роль в формировании дальнейших направлений развития.",
			"published_at": "2024-01-17"
		},
		{
			"id": 2,
			"title": "Стратегическое развитие",
			"image_url": "https://fastly.picsum.photos/id/682/280/150.jpg?hmac=pukJ8CnD4DLhB3p7NajSdbRTkI4mFR75vssvKcknHac",
			"content": "С другой стороны, укрепление организационной структуры позволяет определить ключевые направления стратегического развития. Практика показывает, что системный подход к управлению способствует формированию устойчивых моделей взаимодействия. Не следует, однако, забывать, что развитие инициативы напрямую связано с повышением эффективности принимаемых решений. В целом, комплексный анализ текущих процессов создает предпосылки для дальнейшего роста и оптимизации деятельности.",
			"published_at": "2022-09-30"
		},
		{
			"id": 3,
			"title": "Организационные процессы",
			"image_url": "https://fastly.picsum.photos/id/294/280/150.jpg?hmac=sBCEjg83XSoMc8NisLRu7qJMrWAZS-Fqk3HUm1g8pRw",
			"content": "Равным образом постоянное совершенствование организационных процессов обеспечивает устойчивое развитие системы. Значимость данных факторов очевидна, поскольку они позволяют выстраивать эффективную модель управления. Повседневная практика подтверждает, что четкое распределение ролей и ответственности способствует достижению поставленных целей и укреплению внутренних связей.",
			"published_at": "2021-02-08"
		},
		{
			"id": 4,
			"title": "Кадровая политика",
			"image_url": "https://fastly.picsum.photos/id/452/280/150.jpg?hmac=c5jPdJnh54zZpMi-544-iIJoZdcugCkpiZIQltqghss",
			"content": "Кадровая политика играет ключевую роль в формировании устойчивой и эффективной команды. Системное обучение и развитие персонала позволяют адаптироваться к изменяющимся условиям. В результате создаются предпосылки для повышения качества принимаемых решений и долгосрочного развития организации.",
			"published_at": "2020-06-14"
		},
		{
			"id": 5,
			"title": "Информационное обеспечение",
			"image_url": "https://fastly.picsum.photos/id/570/280/150.jpg?hmac=lGa0Jrwr4h9xLrdspPLWj_kdfQflNhQdCt13QjritzM",
			"content": "Информационное обеспечение деятельности способствует более точной оценке текущей ситуации. Использование актуальных данных позволяет вырабатывать взвешенные управленческие решения. Таким образом, прозрачность процессов и доступность информации становятся важным фактором стабильного развития.",
			"published_at": "2019-11-23"
		}
	],
	"comments": [
		{
			"id": 1,
			"author_id": 1,
			"post_id": 1,
			"content": "Контент комментария",
			"published_at": "2023-01-01"
		}
	]
}
